

import React, { Component } from 'react';
import { AppRegistry, View ,Button } from 'react-native';

export default class AlignItemsBasics extends Component {
    onItemPress = ()=>{
        console.log('onItemPress.....')
        this.newMethod();
    }
    newMethod() {
        /*
        读懂ECMAScript规格
            一、概述
            二、术语
            三、抽象操作的标准流程
            四、相等运算符
            五、数组的空位
            六、数组的 map 方法
        */


        /* 
        //********************************************************************************************************* 
        一、概述
        //********************************************************************************************************* 
        ECMAScript 6 的规格，可以在 ECMA 国际标准组织的官方网站（如下）免费下载和在线阅读。
        http://www.ecma-international.org/ecma-262/6.0/

        ECMAScript 6 规格的 26 章之中，
        第 1 章到第 3 章是对文件本身的介绍，与语言关系不大。
        第 4 章是对这门语言总体设计的描述，有兴趣的读者可以读一下。
        第 5 章到第 8 章是语言宏观层面的描述。
                第 5 章是规格的名词解释和写法的介绍，
                第 6 章介绍数据类型，
                第 7 章介绍语言内部用到的抽象操作，
                第 8 章介绍代码如何运行。
        第 9 章到第 26 章介绍具体的语法。

        对于一般用户来说，除了第 4 章，其他章节都涉及某一方面的细节，不用通读，只要在用到的时候，查阅相关章节即可。
        */



        /* 
        //********************************************************************************************************* 
        二、术语
        //********************************************************************************************************* 
        



        /* 
        //********************************************************************************************************* 
        三、抽象操作的标准流程
        //********************************************************************************************************* 
        
        */


        /* 
        //********************************************************************************************************* 
        四、相等运算符
        //********************************************************************************************************* 
        
        */



        /* 
        //********************************************************************************************************* 
        五、数组的空位
        //********************************************************************************************************* 
        
        */



        /* 
        //********************************************************************************************************* 
        六、数组的 map 方法
        //********************************************************************************************************* 
        
        */
    }
    render() {
        return (
        // 尝试把`alignItems`改为`flex-start`看看
        // 尝试把`justifyContent`改为`flex-end`看看
        // 尝试把`flexDirection`改为`row`看看
        <View style={{
            flex: 1,
            flexDirection: 'column',//column
            justifyContent: 'center',
            alignItems: 'flex-end',//flex-end
            width: 300,
            height:300,
        }}>
            <Button
                onPress={()=>{this.onItemPress()}}
                title=" 点我测试 "
            />
            <View style={{width: 100, height: 50, backgroundColor: 'powderblue'}} />
            <View style={{width: 100, height: 50, backgroundColor: 'skyblue'}} />
            <View style={{width: 100, height: 50, backgroundColor: 'steelblue'}} />
        </View>
        );
    }
};
